
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CinematicCamera
/// dependency: CoreUObject
/// dependency: Engine

#pragma pack(push, 0x1)

/// Class /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C
/// Size: 0x0268 (616 bytes) (0x000228 - 0x000268) align 8 MaxSize: 0x0268
class AMainMenu_Map_C : public ALevelScriptActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0228   (0x0008)  
	class ACineCameraActor*                            CineCameraActor_0_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0230   (0x0008)  
	class ACineCameraActor*                            CineCameraActor_8_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0238   (0x0008)  
	class ACineCameraActor*                            CineCameraActor3_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0240   (0x0008)  
	class ACineCameraActor*                            CineCameraActor_1_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0248   (0x0008)  
	class ACineCameraActor*                            CineCameraActor_2_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0250   (0x0008)  
	class ACineCameraActor*                            CineCameraActor4_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0258   (0x0008)  
	class ACineCameraActor*                            CineCameraActor5_ExecuteUbergraph_MainMenu_Map_RefProperty; // 0x0260   (0x0008)  


	/// Functions
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.Ùfbc
	// void _fbc();                                                                                                             // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.‘èﬁV;
	// void ___V_();                                                                                                            // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.8nb
	// void _8n_b();                                                                                                            // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.6R\
	// void _6R_();                                                                                                             // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.æã
	// void __();                                                                                                               // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.Rbc
	// void _Rbc();                                                                                                             // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0xfa36a0] Event|Protected|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.Rbc0W
	// void _Rbc0W();                                                                                                           // [0xfa36a0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Scene/BurnedDeadForest/Maps/MainMenu_Map.MainMenu_Map_C.ExecuteUbergraph_MainMenu_Map
	// void ExecuteUbergraph_MainMenu_Map(int32_t EntryPoint);                                                                  // [0xfa36a0] Final                
};

#pragma pack(pop)


static_assert(sizeof(AMainMenu_Map_C) == 0x0268); // 616 bytes (0x000228 - 0x000268)
static_assert(offsetof(AMainMenu_Map_C, UberGraphFrame) == 0x0228);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor_0_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0230);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor_8_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0238);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor3_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0240);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor_1_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0248);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor_2_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0250);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor4_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0258);
static_assert(offsetof(AMainMenu_Map_C, CineCameraActor5_ExecuteUbergraph_MainMenu_Map_RefProperty) == 0x0260);
